///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаДанных

Процедура ЗарегистрироватьИзмененияДляАвтономногоРежимаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не СнимкиОтчетов.ЕстьИзмененияДляАвтономногоРежима(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УзлыДляРегистрации = ПланыОбмена._ДемоМобильныйКлиент.УзлыДляРегистрации();
	ПланыОбмена._ДемоМобильныйКлиент.ЗарегистрироватьИзмененияДляУзловОбмена(УзлыДляРегистрации, Источник);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДляАвтономногоРежимаРегистрыПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УзлыДляРегистрации = ПланыОбмена._ДемоМобильныйКлиент.УзлыДляРегистрации();
	ПланыОбмена._ДемоМобильныйКлиент.ЗарегистрироватьИзмененияДляУзловОбменаРегистры(УзлыДляРегистрации, Источник);
	
	Изменения = Новый Массив;
	СнимкиОтчетов.ЗарегистрироватьИзмененияДляАвтономногоРежима(Источник, Изменения);
	Если Изменения.Количество() > 0 Тогда
		ПланыОбмена._ДемоМобильныйКлиент.ЗарегистрироватьИзмененияДляУзловОбмена(УзлыДляРегистрации, Изменения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
