///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Запускает синхронизацию основного и автономного серверов.
// 
// Параметры:
//  КодУзла - Строка
//  НаименованиеМобильногоКомпьютера - Строка
//  НомерОтправленного - Число
//  НомерПринятого - Число
//
// Возвращаемое значение:
//  Строка - код узла синхронизации
//
Функция НачатьСинхронизацию(КодУзла, НаименованиеМобильногоКомпьютера, НомерОтправленного, НомерПринятого) Экспорт
	
	Возврат ПланыОбмена._ДемоМобильныйКлиент.НачатьСинхронизацию(КодУзла, НаименованиеМобильногоКомпьютера, 
		НомерОтправленного, НомерПринятого);
	
КонецФункции

// Выполняет синхронизацию данных:
// получает пакет изменений предназначенных для данного узла и
// записывает пакет изменений принятых от данного узла.
//
// Параметры:
//  КодУзла - Строка - код узла, с которым идет синхронизация данных.
//  ДанныеМобильногоПриложения - ХранилищеЗначения - хранилище, в которое помещен пакет обмена.
//
// Возвращаемое значение:
//  ХранилищеЗначения
//
Функция ВыполнитьОбменДанными(КодУзла, ДанныеМобильногоПриложения) Экспорт
	
	Возврат ПланыОбмена._ДемоМобильныйКлиент.ВыполнитьОбменДанными(КодУзла, ДанныеМобильногоПриложения);
	
КонецФункции

// Проверяет наличие прав на запуск синхронизации основного и автономного серверов.
//
// Возвращаемое значение:
//  Булево - Истина, если есть права на запуск синхронизации.
//
Функция ТребуетсяОбменДаннымиСАвтономнымПриложением() Экспорт

	Возврат ПланыОбмена._ДемоМобильныйКлиент.ТребуетсяОбменДаннымиСАвтономнымПриложением();

КонецФункции

#КонецОбласти