
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСписокОтбораРесурсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДанныхИнформационнойСистемы" Тогда
		
		УстановитьСписокОтбораРесурсов();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИС_ТИПриИзменении(Элемент)
	
	УстановитьСписокОтбораРесурсов();
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СписокРесурсовСистемы(ИнформационнаяСистема)
	
	РесурсыСистемы = Справочники.ИнформационныеСистемы.СписокРесурсовИнформационнойСистемы(ИнформационнаяСистема);
	
	// Удалить первую строку, чтобы не было возможности выбрать базовый ресурс (в С4 он отображется в виде контейнера основной системы).
	Если РесурсыСистемы.Количество() > 0 Тогда
		РесурсыСистемы.Удалить(0);		
	КонецЕсли;
	
	Возврат РесурсыСистемы;

КонецФункции

&НаСервере
Процедура УстановитьСписокОтбораРесурсов()

	ТекущиеПараметрыВыбора = Новый Массив;
	
	
	РесурсыСистемы = СписокРесурсовСистемы(Объект.ИнформационнаяСистемаТИ);
	
	Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(РесурсыСистемы));
	
	ТекущиеПараметрыВыбора.Добавить(Параметр);

	ЭтаФорма.Элементы.РесурсСистемы.ПараметрыВыбора = Новый ФиксированныйМассив(ТекущиеПараметрыВыбора);	
	
КонецПроцедуры 

#КонецОбласти