#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
   ЮТТесты.ДобавитьТестовыйНабор("Генерация UML-диаграмм").ВТранзакции()
   	.ДобавитьТест("ТестСгенерированноеИзображение", "ТестСгенерированноеИзображение: генерация тестового изображения на C4", "Позитив")
   	.ДобавитьТест("ТестСгенерированноеИзображение", "ТестСгенерированноеИзображение: повторная генерация тестового изображения на C4", "Позитив")
	;

КонецПроцедуры

Процедура ТестСгенерированноеИзображение() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	ИсходныйКод = ПримерИсходногоКодаC4();
	ИсходныйКод = СтрШаблон(ИсходныйКод, Строка(Новый УникальныйИдентификатор));
	
	// 2. Выполнение функции.
	ГенерацияUMLДиаграмм = Обработки.ГенерацияUMLДиаграмм.Создать();
	ПараметрыПоУмолчанию = ГенерацияUMLДиаграмм.ПараметрыПоУмолчанию();
	
	// Холодный запуск, т.к. первый раз бывает косячит.
	Результат = ГенерацияUMLДиаграмм.СгенерированноеИзображение(ИсходныйКод, ПараметрыПоУмолчанию);
	ЮТест.Пауза(3);
	
	// Контрольный запуск. 
	Результат = ГенерацияUMLДиаграмм.СгенерированноеИзображение(ИсходныйКод, ПараметрыПоУмолчанию);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.Свойство("АдресИзображения").Заполнено()
		;
		
	Картинка = Результат.ОтветСервера.ПолучитьТелоКакДвоичныеДанные();	
	ЮТест.ОжидаетЧто(Картинка) 
	    .Заполнено()
		;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция генерирует исходный код для диаграммы PlantUML, описывающей модель функций и потоков данных бизнес-доменов.
//
// Возвращаемое значение:
//  Строка - Исходный код для диаграммы PlantUML.
//
Функция ПримерИсходногоКодаC4()
	
	ИсходныйКод = НСтр("ru = '@startuml
                        |!include https://raw.githubusercontent.com/plantuml-stdlib/C4-PlantUML/master/C4_Container.puml
                        |
                        |!define DEVICONS https://raw.githubusercontent.com/tupadr3/plantuml-icon-font-sprites/main/icons/devicons
                        |!define FONTAWESOME https://raw.githubusercontent.com/tupadr3/plantuml-icon-font-sprites/main/icons/font-awesome-5
                        |!define FONTAWESOME6 https://raw.githubusercontent.com/tupadr3/plantuml-icon-font-sprites/main/icons/font-awesome-6
                        |!include DEVICONS/streamline.puml
                        |!include DEVICONS/java.puml
                        |!include DEVICONS/msql_server.puml
                        |!include DEVICONS/prolog.puml
                        |!include DEVICONS/aptana.puml
                        |!include DEVICONS/android.puml
                        |!include DEVICONS/smashing_magazine.puml
                        |!include DEVICONS/terminal.puml
                        |!include DEVICONS/scala.puml
                        |!include DEVICONS/ie.puml
                        |!include FONTAWESOME/users.puml
                        |!include FONTAWESOME6/d.puml
                        |!include <office/Servers/database_server>
                        |!include <office/Servers/file_server>
                        |!include <office/Servers/application_server>
                        |!include <office/Concepts/service_application>
                        |!include <office/Concepts/firewall>
                        |
                        |'' линии без скруглений два варианта
                        |'' skinparam Linetype ortho
                        |'' skinparam Linetype polyline
                        |
                        |AddElementTag(""Введен в эксплуатацию"", $bgColor=""#339933"")
                        |AddElementTag(""Запланирован"", $bgColor=""#FFD700"")
                        |AddElementTag(""В процессе запуска"", $bgColor=""#ff8c69"")
                        |AddElementTag(""Изменения бизнес-домена"", $bgColor=""#FF0033"")
                        |AddRelTag(""Изменение связей бизнес-доменов"", $textColor=""#FF0033"", $lineColor=""#FF0033"", $lineStyle = BoldLine())
                        |
                        |AddRelTag(""ext"", $textColor=""red"", $lineColor=""red"", $sprite=""firewall,scale=0.3,color=red"")
                        |AddRelTag(""uses"", $textColor=""orange"", $lineColor=""orange"")
                        |
                        |'' #ЗаполнениеТеговСвязей#
                        |
                        |title
                        | <b>Модель функций и потоков данных бизнес-доменов</b>
                        |end title 
                        |
                        |
                        |Container(1СБухгалтерияЭкспедиция, ""1С Бухгалтерия Экспедиция"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |System_Boundary(sys1СЗУПСтройнтег, ""1С ЗУП Стройнтег"") {
                        |   
                        |Container(КадрыСтройинтег, ""Кадры Стройинтег"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |
                        |Container(ЗарплатаСтройинтег, ""Зарплата Стройинтег"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |}
                        |
                        |Container(1СБухгалтерияСтройинтегр, ""1С Бухгалтерия Стройинтегр"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |
                        |Container(УАТ, ""УАТ"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |
                        |Container(ПроизводственнаяБезопасность, ""Производственная безопасность"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |System_Boundary(sys1СБухгалтерияВЧ, ""1С Бухгалтерия ВЧ"") {
                        |   
                        |Container(НСИ, ""НСИ"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |
                        |Container(РеглУчет, ""Регл.учет"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |}
                        |
                        |Container(1СБухгалтерияСибЛогистика, ""1С Бухгалтерия СибЛогистика"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |System_Boundary(sys1СЗУПВЧ, ""1С ЗУП ВЧ"") {
                        |   
                        |Container(КадрыВЧ, ""Кадры ВЧ"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |
                        |Container(ЗарплатаВЧ, ""Зарплата ВЧ"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |
                        |Container(УчетРабочегоВремениВЧ, ""Учет рабочего времени ВЧ"", ""Бизнес-домен"", """", $sprite=""d"",$tags=""Введен в эксплуатацию"") 
                        |}
                        |
                        |
                        |Rel(КадрыВЧ, ЗарплатаВЧ, ""1. "","""","""")
                        |
                        |Rel(КадрыВЧ, НСИ, ""2. Физ.лица"","""","""")
                        |
                        |Rel(ЗарплатаВЧ, РеглУчет, ""3. Данные по зп, исп. листы"","""","""")
                        |
                        |Rel(КадрыВЧ, ПроизводственнаяБезопасность, ""4. Физ.лица, стр. предприятия, штатное расписание"","""","""")
                        |
                        |Rel(КадрыВЧ, УАТ, ""5. Физ.лица, стр. предприятия, штатное расписание"","""","""")
                        |
                        |Rel(КадрыСтройинтег, ЗарплатаСтройинтег, ""6. "","""","""")
                        |
                        |Rel(КадрыСтройинтег, 1СБухгалтерияСтройинтегр, ""7. Физ.лица"","""","""")
                        |
                        |Rel(ЗарплатаСтройинтег, 1СБухгалтерияСтройинтегр, ""8. Данные по зп, исп. листы"","""","""")
                        |
                        |Rel(КадрыСтройинтег, 1СБухгалтерияЭкспедиция, ""9. Физ.лица"","""","""")
                        |
                        |Rel(ЗарплатаСтройинтег, 1СБухгалтерияЭкспедиция, ""10. Данные по зп, исп. листы"","""","""")
                        |
                        |Rel(КадрыСтройинтег, УАТ, ""11. Физ.лица, стр. предприятия, штатное расписание"","""","""")
                        |
                        |Rel(КадрыСтройинтег, 1СБухгалтерияСибЛогистика, ""12. Физ.лица"","""","""")
                        |
                        |Rel(ЗарплатаСтройинтег, 1СБухгалтерияСибЛогистика, ""13. Данные по зп, исп. листы"","""","""")
                        |
                        |SHOW_FLOATING_LEGEND()
                        |Lay_Distance(LEGEND(), sys1СЗУПВЧ, 1)
                        |'' Уникальный идентификатор схемы: %1                        
                        |@enduml'"); 
	
	Возврат ИсходныйКод;

КонецФункции

#КонецОбласти