
#Область ПрограммныйИнтерфейс

// Формирует таблицу видов приложений конфигурации.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ВидыПриложений - см. ВидыПриложенийСервер.НоваяТаблицаВидовПриложений.
//
Процедура ПриОпределенииВидовПриложенийКонфигурации(ВидыПриложений) Экспорт
	
	
КонецПроцедуры

// Определяет дополнительные свойства базового вида приложения
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ДополнительныеСвойства - Структура.
//
Процедура ПриОпределенииДопСвойствБазовогоВидаПриложения(ДополнительныеСвойства) Экспорт
	
	
КонецПроцедуры

// Возвращает вид приложения, который будет установлен по умолчанию, 
// если, например, не удалось определить вид приложения по имени или услугам.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ВидПриложения - Структура - см. ВидыПриложенийСервер.НовыйВидПриложения (возвращаемые данные).
//
Процедура ПриОпределенииВидаПриложенияПоУмолчанию(ВидПриложения) Экспорт
	
КонецПроцедуры

// Добавляет в таблицу процедуры-обработчики перехода от одного вида приложения к другому.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  Обработчики - ТаблицаЗначений:
//    * ИсходноеИмяВидаПриложения - Строка - имя вида приложения, с которого выполняется переход.
//    * ИмяВидаПриложения           - Строка - имя вида приложения, на который выполняется переход.
//    * Процедура                   - Строка - полное имя процедуры-обработчика перехода.
//                                             Обязательно должна быть экспортной.
// Примечание:
//  Если отсутствует хотя бы один обработчик с предыдущего до целевого вида приложения, переход будет невозможен
//
Процедура ПриДобавленииОбработчиковПереходаВидовПриложений(Обработчики) Экспорт
	
	
КонецПроцедуры

// Вызывается при установке базового вида приложения.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки. По умолчанию = Ложь.
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПриУстановкеБазовогоВидаПриложения(РезультатОбработки) Экспорт
	
КонецПроцедуры

// Вызывается при отмене установки базового вида приложения.
// Отмена установки базового вида приложения происходит, если выполняется установка постоянного вида приложения.
// Процедура должна вернуть данные, измененные при установке базового вида приложения, в исходное состояние. 
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки. По умолчанию = Ложь.
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПриОтменеУстановкиБазовогоВидаПриложения(РезультатОбработки) Экспорт
	
КонецПроцедуры

// Вызывается после установки вида приложения.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ВидПриложения - Строка - имя вида приложения.
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки. По умолчанию = Ложь.
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПослеУстановкиВидаПриложения(ВидПриложения, РезультатОбработки) Экспорт
	
	
КонецПроцедуры

// Вызывается перед процедурами-обработчиками перехода на новый вид приложения.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ВидПриложения - Строка - имя вида приложения, с которого выполняется переход.
//  ЦелевойВидПриложения - Строка - имя вида приложения, на который выполняется переход.
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки. По умолчанию = Ложь.
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПередПереходомНаВидПриложения(ВидПриложения, ЦелевойВидПриложения, РезультатОбработки) Экспорт
	
КонецПроцедуры

// Вызывается после завершения перехода на новый вид приложения.
// @skip-warning ПустойМетод - переопределяемый метод.
// Параметры:
//  ВидПриложения - Строка - имя вида приложения, с которого выполнен переход.
//  ЦелевойВидПриложения - Строка - имя вида приложения, на который выполнен переход.
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки. По умолчанию = Ложь.
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПослеПереходаНаВидПриложения(ВидПриложения, ЦелевойВидПриложения, РезультатОбработки) Экспорт
	
	
КонецПроцедуры

// Определяет параметры уведомления об обновлении вида приложения.
// @skip-warning ПустойМетод - переопределяемый метод.
// Параметры:
//  ПараметрыУведомления - см. ВидыПриложенийСервер.НовыйПараметрыУведомленияОбОбновлении.
//
Процедура ПриОпределенииПараметровУведомления(ПараметрыУведомления) Экспорт
	
	
КонецПроцедуры

// Определяет массив имен расширений видов приложений, которые будут исключены из выгрузки
//  
// @skip-warning ПустойМетод - переопределяемый метод.
// Параметры:
//  ИменаРасширений - Массив из Строка
//
Процедура ПриОпределенииИменРасширенийВидовПриложений(ИменаРасширений) Экспорт
	
	
КонецПроцедуры

#КонецОбласти