
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	Наименование = СтрШаблон(НСтр("ru = '[%1]->[%2]: %3'"), Источник, Приемник, КраткоеНаименование);
	
	// список точек интеграции в строке ТочкиИнтеграции
	МассивТочек = СписокТочекИнтеграции.ВыгрузитьКолонку("ТочкаИнтеграции");
	МассивТочек = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТочек);
	Если ЗначениеЗаполнено(МассивТочек) Тогда
		ТочкиИнтеграции = СтрСоединить(МассивТочек, "; ");
    Иначе
		ТочкиИнтеграции = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли