#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 И Модифицированность() Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Запрещено удалять данные вида приложения'");
	КонецЕсли;
	
КонецПроцедуры

// @skip-check data-exchange-load
Процедура ПриЗаписи(Отказ, Замещение)
	
	// ОбменДанными.Загрузка не проверяется, чтобы нельзя было добавить некорректную запись.
	// Проверку нужно выполнять именно в ПриЗаписи, т.к. здесь гарантированно заполнен ОбластьДанныхВспомогательныеДанные.
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ОбластьДанныхВспомогательныеДанные = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Запрещено устанавливать вид приложения для области со значением разделителя 0'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли