///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если МобильныйАвтономныйСервер Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//	Структура:
//		* Принято - Число
//		* Отправлено - Число
//
Функция ПринятоОтправленоНовыхЗаписей() Экспорт
	
	Возврат ПланыОбмена._ДемоМобильныйКлиент.ПринятоОтправленоНовыхЗаписей();
	
КонецФункции

// Выполняет синхронизацию данных с основной базой через опубликованный ею веб-сервис.
//
Процедура ВыполнитьОбменДанными() Экспорт

	ПланыОбмена._ДемоМобильныйКлиент.ВыполнитьОбменДаннымиВМобильномАвтономномСервере();

КонецПроцедуры

// Проверяет, завершено ли фоновое задание синхронизации данных.
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - идентификатор фонового задания.
//  ТекстОшибки - Строка - параметр для возврата информации об ошибках.
//
// Возвращаемое значение:
//  Булево - Истина, если задание завершено.
//
Функция ОбменДаннымиЗакончен(Знач Идентификатор, ТекстОшибки) Экспорт

	Возврат ПланыОбмена._ДемоМобильныйКлиент.ОбменДаннымиЗакончен(Идентификатор, ТекстОшибки);

КонецФункции

// Запускает фоновое задание для синхронизации данных.
//
// Возвращаемое значение:
//  УникальныйИдентификатор
//
Функция ВыполнитьОбменДаннымиВФоне() Экспорт
	
	Возврат ПланыОбмена._ДемоМобильныйКлиент.ВыполнитьОбменДаннымиВФоне();
	
КонецФункции

#КонецОбласти

#КонецЕсли

