///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейКлиентСерверПереопределяемый.
//
// Клиент-серверные переопределяемые процедуры и функции Интернет-поддержка пользователей:
//  - определение настроек библиотеки.
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Определяет настройки Интернет-поддержки пользователей.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы на клиенте:
//   *ОтключитьАвторизацию - Булево - отключает авторизацию пользователей
//     при переходе на страницы интегрированных ресурсов.
//
//@skip-warning
Процедура ПриОпределенииНастроекИнтернетПоддержкиПользователей(Настройки)Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
