///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Наименования = УправлениеПечатью.НаименованияСформированныхОсновныхПечатныхФорм(Строки.ПолучитьКлючи());
	
	Для Каждого Строка Из Строки Цикл
		НаименованиеПечатнойФормы = Наименования[Строка.Ключ.Ссылка];
		Если ПустаяСтрока(НаименованиеПечатнойФормы) Тогда
			НаименованиеПечатнойФормы = НСтр("ru = 'Продажа'");
		КонецЕсли;
		
		ШаблонСтроки = НСтр("ru = '%1 №%2 от %3'");
		Документ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, НаименованиеПечатнойФормы, Строка.Значение.Данные.Номер, Формат(Строка.Значение.Данные.Дата, "ДЛФ=D;"));
		Строка.Значение.Данные.ДокументКонтрагента = Документ;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти