#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Загружает данные информационной базы.
//
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//		контейнера, используемый в процессе выгрузи данных. Подробнее см. комментарий
//		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//	Обработчики - ОбщийМодуль
//				- ОбработкаМенеджер
//	СоответствиеСсылок - Соответствие из ЛюбаяСсылка - соответствие ссылок
// Возвращаемое значение:
//	ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок
//
Функция ЗагрузитьДанныеИнформационнойБазы(Контейнер, Обработчики, СоответствиеСсылок = Неопределено) Экспорт
	
	ЗагружаемыеТипы = Контейнер.ПараметрыЗагрузки().ЗагружаемыеТипы;
	ИсключаемыеТипы = ВыгрузкаЗагрузкаДанныхСлужебныйСобытия.ПолучитьТипыИсключаемыеИзВыгрузкиЗагрузки();
	
	МенеджерЗагрузки = Создать();
	МенеджерЗагрузки.Инициализировать(
		Контейнер,
		ЗагружаемыеТипы,
		ИсключаемыеТипы,
		Обработчики,
		СоответствиеСсылок);
	МенеджерЗагрузки.ЗагрузитьДанные();
	
	Возврат МенеджерЗагрузки.ТекущийПотокЗаменыСсылок();
	
КонецФункции

// Загрузить данные информационной базы в потоке.
// 
// Параметры:
//  ПараметрыПотока - Структура - см. свойство Параметры в
//  	ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы.ЗапуститьПотокиЗагрузкиДанных
// 
Процедура ЗагрузитьДанныеИнформационнойБазыВПотоке(ПараметрыПотока) Экспорт
	
	Контейнер = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.Создать();
	Контейнер.ИнициализироватьЗагрузкуВПотоке(ПараметрыПотока.Контейнер);
	
	Обработчики = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных.Создать();
	Обработчики.Инициализировать();
	
	ЗагружаемыеТипы = Неопределено;
	ИсключаемыеТипы = Неопределено;
	СоответствиеСсылок = Новый Соответствие(ПараметрыПотока.ПотокЗаменыСсылок.СоответствиеСсылок);
		
	МенеджерЗагрузки = Создать();
	МенеджерЗагрузки.Инициализировать(
		Контейнер,
		ЗагружаемыеТипы,
		ИсключаемыеТипы,
		Обработчики,
		СоответствиеСсылок);
	МенеджерЗагрузки.ЗагрузитьДанныеВПотоке();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
