#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает массив ресурсов информационной системы
//
// Параметры:
//  ИнформационнаяСистема	 - СправочникСсылка.ИнформационныеСистемы - инф.система 
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.ИнформационныеСистемы 
//
Функция СписокРесурсовИнформационнойСистемы(ИнформационнаяСистема) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеСистемыРесурсы.РесурсИнформационнойСистемы КАК РесурсИнформационнойСистемы
	               |ИЗ
	               |	Справочник.ИнформационныеСистемы.Ресурсы КАК ИнформационныеСистемыРесурсы
	               |ГДЕ
	               |	ИнформационныеСистемыРесурсы.Ссылка = &Ссылка
	               |	И НЕ ИнформационныеСистемыРесурсы.РесурсИнформационнойСистемы.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИнформационныеСистемыРесурсы.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ИнформационнаяСистема);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить();
	
	МассивДанных = Выборка.ВыгрузитьКолонку("РесурсИнформационнойСистемы");
	
	Возврат МассивДанных;

КонецФункции


#КонецОбласти

#КонецЕсли