
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СокращеннаяСтрокаАрхитектуры = "";
	Если АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ВебСервер Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Веб сервер>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ФайловыйСервер Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Файловый сервер>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.СерверБазДанных Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<СУБД>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.КонсольноеПриложение Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Набор скриптов>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ИнтеграционнаяШина Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<ESB>";
		
	ИначеЕсли АрхитектураРаботы = Перечисления.АрхитектурыРаботыИС.ВнешнийСервис Тогда
	
		 СокращеннаяСтрокаАрхитектуры = "<Внешняя>";
		
	Иначе 
		// Приложение и прочие
		СокращеннаяСтрокаАрхитектуры = "";
	
	КонецЕсли;
	
	Наименование = СтрШаблон(НСтр("ru = '%2%1'"), КраткоеНаименование, СокращеннаяСтрокаАрхитектуры);

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли