///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПодборФИО".
// ОбщийМодуль.ПодборФИОВызовСервера.
//
// Серверные процедуры работы с классификатором ФИО:
//  - возврат значений классификатора ФИО по переданным параметрам поиска.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает результат определения пола по данным классификатора.
//
// Параметры:
//  ДанныеФИО - Структура, Неопределено - описывает данные ФИО, по которым будет выполняться поиск.
//  Если передано свойство "Представление", поиск будет выполнятся по нему.
//    * Фамилия - Строка - описывает фамилию лица. Свойство может не передаваться.
//    * Имя - Строка - описывает имя лица. Свойство может не передаваться.
//    * Отчество - Строка - описывает отчество лица. Свойство может не передаваться.
//    * Представление - Строка - описывает ФИО лица. Свойство может не передаваться.
//  Возвращаемое значение:
//    Число - значение пола по данным классификатора, может принимать значения:
//      1- мужской, 2 - женский, 3 - допустимы оба.
//
Функция ОпределитьПол(Знач ДанныеФИО) Экспорт
	
	Возврат ПодборФИО.ОпределитьПол(ДанныеФИО);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. ПодборФИО.Подобрать.
//
Функция Подобрать(
		Знач РежимПоиска,
		Знач ДанныеФИО,
		Знач Пол,
		Знач РазмерВыборки) Экспорт
	
	Возврат ПодборФИО.Подобрать(
		РежимПоиска,
		ДанныеФИО,
		Пол,
		РазмерВыборки);
	
КонецФункции

// См. ПодборФИО.НайтиФИО.
//
Функция НайтиФИО(
		Знач ЧастиФИО,
		Знач ПолноеСовпадение = Истина) Экспорт
	
	Возврат ПодборФИО.НайтиФИО(
		ЧастиФИО,
		ПолноеСовпадение);
	
КонецФункции

#КонецОбласти
