///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.РаботаСКлассификаторами".
// ОбщийМодуль.РаботаСКлассификаторамиКлиентСервер.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Возвращает идентификатор ключа объекта хранилища общих настроек.
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторОбщихНастроек() Экспорт
	
	Возврат "ИнтернетПоддержка_РаботаСКлассификаторами";
	
КонецФункции

// Возвращает идентификатор ключа настройки общего хранилища, который хранит 
// дату информирования о включении загрузки обновлений.
//
// Возвращаемое значение:
//  Строка
//
Функция КлючНастройкиДатаИнформированияОВключенииЗагрузкиОбновлений() Экспорт
	
	Возврат "ДатаИнформированияОВключенииЗагрузкиОбновлений";
	
КонецФункции

#КонецОбласти