///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Включить(Команда)
	
	РаботаСКлассификаторамиВызовСервера.ВключитьАвтоматическоеОбновлениеКлассификаторовИзСервиса();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозже(Команда)
	
	// Напомнить через 7 дней.
	ДатаИнформирования = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса() + 604800);
	
	ОбщегоНазначенияКлиент.ХранилищеОбщихНастроекСохранить(
		РаботаСКлассификаторамиКлиентСервер.ИдентификаторОбщихНастроек(),
		РаботаСКлассификаторамиКлиентСервер.КлючНастройкиДатаИнформированияОВключенииЗагрузкиОбновлений(),
		ДатаИнформирования);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеПоказывать(Команда)
	
	ОбщегоНазначенияКлиент.ХранилищеОбщихНастроекСохранить(
		РаботаСКлассификаторамиКлиентСервер.ИдентификаторОбщихНастроек(),
		РаботаСКлассификаторамиКлиентСервер.КлючНастройкиДатаИнформированияОВключенииЗагрузкиОбновлений(),
		'39991231');
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти